tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/UnboundedFluidizationCases/diluteUnboundedFluidizationSystem/CFD/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // create cell set to calculate the statistics
    {
        name    magLensCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.0041 -0.0041 -0.003)(0.0041 0.0041 0.003);
        }
    }
    
    
    //create cell zone
    {
        name    magLensCellZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set magLensCellSet;
        }
    }
);


// ************************************************************************* //
